{"pageProps":{"posts":[{"slug":"2020-11-12-traefik-middlewares","title":"Traefik - Middlewares","date":"2020-11-12T14:44:54.748Z","description":"Creare i meddlewares base per Traefik","image":null,"tags":["self-hosted","traefik","middlewares"],"content":"Buongiorno a tutti,  \noggi vedremo come creare i primi e più semplici middlewares per Traefik.  \nCosa è un middleware?   \nSemplificando molto è qualcosa che si frappone tra la chiamata e il servizio finale o viceversa.\n\n![middlwares](https://doc.traefik.io/traefik/assets/img/middleware/overview.png \"Esempio middlewares Traefik\")\n\nNella mia configurazione ho creato tre middlewares che trovo molto utili. Per crearli basta creare un file all'interno della cartella dynamic vista nel primo articolo dedicato a Traefik ([lo trovate qui](/posts/2020-11-04-traefik-intro/)).   \nE' anche possibile crearli tramite label dei container, utile se è specifico per un determinato servizio.\n\n1. Redirect to https, abbastanza semplice da capire, effettua il redirect delle chiamate verso lo schema specificato. Nel mio caso tutte verso https.\n\n   ```yaml\n   ---\n\n   http:\n     middlewares:\n       redirect-to-https:\n         redirectScheme:\n           scheme: https\n   ```\n\n\n2. Basic auth, utile per redendere un po' più sicuro un endpoint aggiungendo un'autenticazione.  \n   E' possibile specificare l'elenco di coppie username: password, la password deve essere criptata tramite MD5, SHA1, o BCrypt, per fare questo è possibile utilizzare su sistemi Linux `htpasswd`. E' anche possibile specificare il path di un file contenente gli utenti, sempre nello stesso formato, tramite l'attributo `usersFile `al posto di `users`.\n\n   ```yaml\n   ---\n\n   http:\n     middlewares:\n       basic-auth:\n         basicAuth:\n           users:\n             - \"<username>:<password>\"\n   ```\n3. Compressione della risposta, credo sia uno dei più importanti per limitare il consumo di banda. Comprime le risposte limitando appunto i dati scambiati.\n\n   ```yaml\n   ---\n\n   http:\n     middlewares:\n       gzip-compress:\n         compress: {}\n   ```\n\nPer utilizzare un middleware basta specificarlo nella configurazione della route.\n\n```yaml\n# Se utilizzate un file come impostazione.\nhttp:\n  routers:\n    nome-route:\n      middlewares:\n        - gzip-compress\n        - redirect-to-https\n        \n        \n# Se utilizzate le labels di un container come impostazione.\ntraefik.http.routers.nome-route.middlewares: gzip-compress@file, redirect-to-https@file\n```\n\nSpero di esservi stato utile e rimango sempre a disposizione per aiutarvi."}],"slug":null,"_superjson":{"values":{"posts.0.date":["Date"],"posts.0.image":["undefined"],"slug":["undefined"]}}},"__N_SSG":true}